In [22]:
import pandas as pd
import numpy as np
stuff={ 'a':[1,2,3],'b':[4,np.nan,6], 'c':[7,8,9],'d':[10,11,12]}
df = pd.DataFrame(stuff)
df

   a    b  c   d
0  1  4.0  7  10
1  2  NaN  8  11
2  3  6.0  9  12

In [16]:
df.dropna()

   a    b  c   d
0  1  4.0  7  10

In [17]:
df.dropna(axis=1)

   a  c   d
0  1  7  10
1  2  8  11
2  3  9  12

In [21]:
df.dropna(thresh=2, axis=1)

   a  c   d
0  1  7  10
1  2  8  11
2  3  9  12

In [23]:
df.fillna(value=99)

   a     b  c   d
0  1   4.0  7  10
1  2  99.0  8  11
2  3   6.0  9  12

In [24]:
df.fillna(value=df['b'].mean())

   a    b  c   d
0  1  4.0  7  10
1  2  5.0  8  11
2  3  6.0  9  12

In [26]:
df.fillna(value=df['b'].sum())

   a     b  c   d
0  1   4.0  7  10
1  2  10.0  8  11
2  3   6.0  9  12